In [1]:
import pandas as pd

In [3]:
minha_serie = pd.Series([4,7,-5,3])

In [4]:
minha_serie[minha_serie > 0]

0    4
1    7
3    3
dtype: int64

In [5]:
minha_serie[0]

4

In [6]:
import numpy as np

In [10]:
np.log(minha_serie[minha_serie > 0])

0    1.386294
1    1.945910
3    1.098612
dtype: float64

In [18]:
1 in minha_serie.values

False

In [13]:
minha_serie

0    4
1    7
2   -5
3    3
dtype: int64

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [20]:
meu_frame = pd.DataFrame(data)

In [21]:
meu_frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [27]:
meu_frame[(meu_frame['year'] >= 2001) & (meu_frame['pop'] > 2)]

    state  year  pop
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [33]:
meu_frame.T

          0     1     2       3       4       5
state  Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     3.2

In [32]:
meu_frame['state'].unique()

array(['Ohio', 'Nevada'], dtype=object)

In [37]:
meu_frame['debt'] = np.arange(6)

In [41]:
meu_frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4    10
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [51]:
meu_frame[meu_frame['state'] == 'Nevada']['debt']

3    10
4     4
5     5
Name: debt, dtype: int64

In [47]:
meu_frame

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4    10
4  Nevada  2002  2.9     4
5  Nevada  2003  3.2     5

In [65]:
meu_frame.at[2, 'debt'] = 90

In [67]:
meu_frame.at[0] = ["a", 1991, 1.4, 0]

In [68]:
meu_frame

    state  year  pop  debt
0       a  1991  1.4     0
1    Ohio  2001  1.7    11
2    Ohio  2002  3.6    90
3  Nevada  2001  2.4    11
4  Nevada  2002  2.9    11
5  Nevada  2003  3.2    11

In [71]:
meu_frame[(meu_frame['state'] == 'Nevada') | (meu_frame['year'] == 2002)]

    state  year  pop  debt
2    Ohio  2002  3.6    90
3  Nevada  2001  2.4    11
4  Nevada  2002  2.9    11
5  Nevada  2003  3.2    11

In [72]:
meu_frame.describe()

              year       pop       debt
count     6.000000  6.000000   6.000000
mean   2000.000000  2.533333  22.333333
std       4.472136  0.861781  33.440494
min    1991.000000  1.400000   0.000000
25%    2001.000000  1.875000  11.000000
50%    2001.500000  2.650000  11.000000
75%    2002.000000  3.125000  11.000000
max    2003.000000  3.600000  90.000000